japanese.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-16 Tue 21:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Organic Japanese lesson notes</title>
<meta name="author" content="Jordan Cross" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Organic Japanese lesson notes
<br />
<span class="subtitle">My follow-along notes from the Organic Japanese course on Youtube: <a href="https://www.youtube.com/playlist?list=PLg9uYxuZf8x_A-vcqqyOFZu06WlhnypWj">https://www.youtube.com/playlist?list=PLg9uYxuZf8x_A-vcqqyOFZu06WlhnypWj</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb6d1ee2">1. Lesson 1: The core Japanese sentence</a></li>
<li><a href="#org32ca8d8">2. Lesson 2: Core secrets</a>
<ul>
<li><a href="#orgd7b24cd">2.1. The invisible が carriage</a></li>
<li><a href="#orgc923d08">2.2. The を carriage</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb6d1ee2" class="outline-2">
<h2 id="orgb6d1ee2"><span class="section-number-2">1</span> Lesson 1: The core Japanese sentence</h2>
<div class="outline-text-2" id="text-1">
<p>
Every Japanese sentence is fundamentally the same, they have the same core.
</p>

<p>
Every sentence is formed of two elements, (visualised as a train) they are the <i>carriage</i> and <i>engine</i>.
</p>

<p>
In all languages there are only two kinds of sentence:
</p>
<ul class="org-ul">
<li>A is B: Sakura is Japanese</li>
<li>A does B: Sakura Walks</li>
</ul>

<p>
Sakura ga nihonjin da - Sakira is Japanese
Sakura ga aruku - Sakura walks
</p>

<p>
Going back to the train metaphor:
</p>
<pre class="example" id="org4ae2791">
 /Carriage/      /Engine/
[Sakura *が*] [Nihonjin *だ*]
</pre>

<p>
There is a third form of the Japanese sentence core sentence:
</p>
<pre class="example" id="org04162ee">
/Carriage/  /Engine/
[Pen *が*] [aka *い*] = Pen is red
</pre>

<p>
This is similar, but not identical to an adjective. This will be discussed more later.
</p>

<p>
To recap, all of these sentences begin with the subject, they are connected with が, and the three <i>engines</i> of the Japanese core sentence are:
</p>
<pre class="example" id="orgcaa9486">
- う - verb          - A does B
- だ - noun          - A is B
- い - /"adjective"/ - A is B
</pre>
</div>
</div>

<div id="outline-container-org32ca8d8" class="outline-2">
<h2 id="org32ca8d8"><span class="section-number-2">2</span> Lesson 2: Core secrets</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd7b24cd" class="outline-3">
<h3 id="orgd7b24cd"><span class="section-number-3">2.1</span> The invisible が carriage</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Last lesson we covered the が <i>carriage</i>. Part of the reason so many people struggle with Japanese is that, although we can always see the <i>engine</i> of the sentence, we cannot always see the が carriage. Remember, the core of the Japanese sentence is formed of the が carriage and an engine.
</p>

<p>
The closest English equivalent to this invisible が carriage is &rsquo;it&rsquo;. Here is an example English sentence:
</p>

<blockquote>
<p>
The ball rolled down the hill. When the ball got to the bottom the ball hit a sharp stone and the ball was punctured and all the air came out of the ball.
</p>
</blockquote>

<p>
This is not a sentence we would ever say in English, once we have established that we are talking about &rsquo;the ball&rsquo; we would instead refer to the ball with it:
</p>

<blockquote>
<p>
The ball rolled downm the hill. When it got to the bottom it hit a sharp stone and it was punctured and all the air came out of it.
</p>
</blockquote>

<p>
If we were to completely omit <i>it</i> the sentence would still be easy to understand, we don&rsquo;t <i>need</i> to use this it marker each time, but English grammar <b>demands</b> it. Japanese does not, hence the &rsquo;invisible&rsquo; が carriage.
</p>

<p>
&rsquo;It&rsquo; by itself doesn&rsquo;t really mean anything, we know what it means from context. If a child comes downstairs in the middle of the night and says <i>&rsquo;Got really hungry&rsquo;</i>, <i>&rsquo;Came for something to eat&rsquo;</i> we understand that the child means <i>&rsquo;I got really hungry&rsquo;</i> not <i>&rsquo;The dog got really hungry&rsquo;</i>. In English this isn&rsquo;t a proper sentence, but in Japanese it is.
</p>

<p>
All of the little pronouns I/it/we/he/they can all be replaced by the invisible が carriage; the ∅ pronoun. It is important to remember that the carriage <b>is</b> still there.
</p>

<p>
One might say: ドリーだ meaning <i>&rsquo;I am Dolly&rsquo;</i>. The full sentence being: ∅がドリーだ.
</p>

<p>
By default &rsquo;I&rsquo; is the default value of this <b>∅ pronoun</b>. However, if someone were introducing their daughter and said ドリーだ we would understand from context that ∅ meant this/she.
</p>

<p>
If I say 土曜日だ <i>&rsquo;It is Saturday&rsquo;</i> it is clear that ∅ means <i>today</i>.
</p>

<p>
Each of these sentences are complete grammatical sentences with a subject marked by が and an engine, but in each of these cases the が carriage is just invisible. It <b>is</b> still there. This may seem to be arbitrary, or over-complicated but it saves a lot of grief later on to model sentences this way. Without this information as sentences become more complex they&rsquo;re going to seem increasingly vague and hard to understand.
</p>
</div>
</div>

<div id="outline-container-orgc923d08" class="outline-3">
<h3 id="orgc923d08"><span class="section-number-3">2.2</span> The を carriage</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This carriage is formed of a noun and the particle を. The を particle marks the object of the sentence. The thing that some verb (the engine) is being done to (が marks the thing doing the verb). It is not part of the core sentence which is always formed of the が carriage and an engine.
</p>

<pre class="example" id="org82558a7">
/carriage/ /carriage/ /engine/
[わたしが]  [ケーキを]  [たべる]
     I        cake      eat
</pre>

<p>
The core sentence here is &rsquo;I eat&rsquo;. The extra carriage, the を carriage is telling us more about the engine. <i>What</i> are we eating? We are eating cake.
</p>

<p>
Once again, we would often see this said as: ケーキをたべる. This is just another case with the invisible が carriage. We <b>cannot</b> have a sentence without a が, we <b>cannot</b> have a sentence without a doer.
</p>

<p>
When we are saying ケーキをたべる, what we are really saying is ∅がケーキをたべる. And the default value for ∅ is わたし: <i>I</i>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jordan Cross</p>
<p class="date">Created: 2021-03-16 Tue 21:07</p>
</div>
</body>
</html>
