japanese.tex
% Created 2021-03-16 Tue 21:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jordan Cross}
\date{\today}
\title{Organic Japanese lesson notes\\\medskip
\large My follow-along notes from the Organic Japanese course on Youtube: \url{https://www.youtube.com/playlist?list=PLg9uYxuZf8x\_A-vcqqyOFZu06WlhnypWj}}
\hypersetup{
 pdfauthor={Jordan Cross},
 pdftitle={Organic Japanese lesson notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Lesson 1: The core Japanese sentence}
\label{sec:org2dc03ca}
Every Japanese sentence is fundamentally the same, they have the same core.

Every sentence is formed of two elements, (visualised as a train) they are the \emph{carriage} and \emph{engine}.

In all languages there are only two kinds of sentence:
\begin{itemize}
\item A is B: Sakura is Japanese
\item A does B: Sakura Walks
\end{itemize}

Sakura ga nihonjin da - Sakira is Japanese
Sakura ga aruku - Sakura walks

Going back to the train metaphor:
\begin{verbatim}
 /Carriage/      /Engine/
[Sakura *が*] [Nihonjin *だ*]
\end{verbatim}

There is a third form of the Japanese sentence core sentence:
\begin{verbatim}
/Carriage/  /Engine/
[Pen *が*] [aka *い*] = Pen is red
\end{verbatim}

This is similar, but not identical to an adjective. This will be discussed more later.

To recap, all of these sentences begin with the subject, they are connected with が, and the three \emph{engines} of the Japanese core sentence are:
\begin{verbatim}
- う - verb          - A does B
- だ - noun          - A is B
- い - /"adjective"/ - A is B
\end{verbatim}

\section{Lesson 2: Core secrets}
\label{sec:org6a7201e}
\subsection{The invisible が carriage}
\label{sec:org162db38}
Last lesson we covered the が \emph{carriage}. Part of the reason so many people struggle with Japanese is that, although we can always see the \emph{engine} of the sentence, we cannot always see the が carriage. Remember, the core of the Japanese sentence is formed of the が carriage and an engine.

The closest English equivalent to this invisible が carriage is 'it'. Here is an example English sentence:

\begin{quote}
The ball rolled down the hill. When the ball got to the bottom the ball hit a sharp stone and the ball was punctured and all the air came out of the ball.
\end{quote}

This is not a sentence we would ever say in English, once we have established that we are talking about 'the ball' we would instead refer to the ball with it:

\begin{quote}
The ball rolled downm the hill. When it got to the bottom it hit a sharp stone and it was punctured and all the air came out of it.
\end{quote}

If we were to completely omit \emph{it} the sentence would still be easy to understand, we don't \emph{need} to use this it marker each time, but English grammar \textbf{demands} it. Japanese does not, hence the 'invisible' が carriage.

'It' by itself doesn't really mean anything, we know what it means from context. If a child comes downstairs in the middle of the night and says \emph{'Got really hungry'}, \emph{'Came for something to eat'} we understand that the child means \emph{'I got really hungry'} not \emph{'The dog got really hungry'}. In English this isn't a proper sentence, but in Japanese it is.

All of the little pronouns I/it/we/he/they can all be replaced by the invisible が carriage; the ∅ pronoun. It is important to remember that the carriage \textbf{is} still there.

One might say: ドリーだ meaning \emph{'I am Dolly'}. The full sentence being: ∅がドリーだ.

By default 'I' is the default value of this \textbf{∅ pronoun}. However, if someone were introducing their daughter and said ドリーだ we would understand from context that ∅ meant this/she.

If I say 土曜日だ \emph{'It is Saturday'} it is clear that ∅ means \emph{today}.

Each of these sentences are complete grammatical sentences with a subject marked by が and an engine, but in each of these cases the が carriage is just invisible. It \textbf{is} still there. This may seem to be arbitrary, or over-complicated but it saves a lot of grief later on to model sentences this way. Without this information as sentences become more complex they're going to seem increasingly vague and hard to understand.

\subsection{The を carriage}
\label{sec:org38d056f}
This carriage is formed of a noun and the particle を. The を particle marks the object of the sentence. The thing that some verb (the engine) is being done to (が marks the thing doing the verb). It is not part of the core sentence which is always formed of the が carriage and an engine.

\begin{verbatim}
/carriage/ /carriage/ /engine/
[わたしが]  [ケーキを]  [たべる]
     I        cake      eat
\end{verbatim}

The core sentence here is 'I eat'. The extra carriage, the を carriage is telling us more about the engine. \emph{What} are we eating? We are eating cake.

Once again, we would often see this said as: ケーキをたべる. This is just another case with the invisible が carriage. We \textbf{cannot} have a sentence without a が, we \textbf{cannot} have a sentence without a doer.

When we are saying ケーキをたべる, what we are really saying is ∅がケーキをたべる. And the default value for ∅ is わたし: \emph{I}.
\end{document}
