japanese.md

# Table of Contents

1.  [Lesson 1: The core Japanese sentence](#org1e85a45)
2.  [Lesson 2: Core secrets](#org3b7e16c)
    1.  [The invisible が carriage](#org5c8c489)
    2.  [The を carriage](#org888211e)



<a id="org1e85a45"></a>

# Lesson 1: The core Japanese sentence

Every Japanese sentence is fundamentally the same, they have the same core.

Every sentence is formed of two elements, (visualised as a train) they are the *carriage* and *engine*.

In all languages there are only two kinds of sentence:

-   A is B: Sakura is Japanese
-   A does B: Sakura Walks

Sakura ga nihonjin da - Sakira is Japanese
Sakura ga aruku - Sakura walks

Going back to the train metaphor:

     /Carriage/      /Engine/
    [Sakura *が*] [Nihonjin *だ*]

There is a third form of the Japanese sentence core sentence:

    /Carriage/  /Engine/
    [Pen *が*] [aka *い*] = Pen is red

This is similar, but not identical to an adjective. This will be discussed more later.

To recap, all of these sentences begin with the subject, they are connected with が, and the three *engines* of the Japanese core sentence are:

    - う - verb          - A does B
    - だ - noun          - A is B
    - い - /"adjective"/ - A is B


<a id="org3b7e16c"></a>

# Lesson 2: Core secrets


<a id="org5c8c489"></a>

## The invisible が carriage

Last lesson we covered the が *carriage*. Part of the reason so many people struggle with Japanese is that, although we can always see the *engine* of the sentence, we cannot always see the が carriage. Remember, the core of the Japanese sentence is formed of the が carriage and an engine.

The closest English equivalent to this invisible が carriage is &rsquo;it&rsquo;. Here is an example English sentence:

> The ball rolled down the hill. When the ball got to the bottom the ball hit a sharp stone and the ball was punctured and all the air came out of the ball.

This is not a sentence we would ever say in English, once we have established that we are talking about &rsquo;the ball&rsquo; we would instead refer to the ball with it:

> The ball rolled downm the hill. When it got to the bottom it hit a sharp stone and it was punctured and all the air came out of it.

If we were to completely omit *it* the sentence would still be easy to understand, we don&rsquo;t *need* to use this it marker each time, but English grammar **demands** it. Japanese does not, hence the &rsquo;invisible&rsquo; が carriage.

&rsquo;It&rsquo; by itself doesn&rsquo;t really mean anything, we know what it means from context. If a child comes downstairs in the middle of the night and says *&rsquo;Got really hungry&rsquo;*, *&rsquo;Came for something to eat&rsquo;* we understand that the child means *&rsquo;I got really hungry&rsquo;* not *&rsquo;The dog got really hungry&rsquo;*. In English this isn&rsquo;t a proper sentence, but in Japanese it is.

All of the little pronouns I/it/we/he/they can all be replaced by the invisible が carriage; the ∅ pronoun. It is important to remember that the carriage **is** still there.

One might say: ドリーだ meaning *&rsquo;I am Dolly&rsquo;*. The full sentence being: ∅がドリーだ.

By default &rsquo;I&rsquo; is the default value of this **∅ pronoun**. However, if someone were introducing their daughter and said ドリーだ we would understand from context that ∅ meant this/she.

If I say 土曜日だ *&rsquo;It is Saturday&rsquo;* it is clear that ∅ means *today*.

Each of these sentences are complete grammatical sentences with a subject marked by が and an engine, but in each of these cases the が carriage is just invisible. It **is** still there. This may seem to be arbitrary, or over-complicated but it saves a lot of grief later on to model sentences this way. Without this information as sentences become more complex they&rsquo;re going to seem increasingly vague and hard to understand.


<a id="org888211e"></a>

## The を carriage

This carriage is formed of a noun and the particle を. The を particle marks the object of the sentence. The thing that some verb (the engine) is being done to (が marks the thing doing the verb). It is not part of the core sentence which is always formed of the が carriage and an engine.

    /carriage/ /carriage/ /engine/
    [わたしが]  [ケーキを]  [たべる]
         I        cake      eat

The core sentence here is &rsquo;I eat&rsquo;. The extra carriage, the を carriage is telling us more about the engine. *What* are we eating? We are eating cake.

Once again, we would often see this said as: ケーキをたべる. This is just another case with the invisible が carriage. We **cannot** have a sentence without a が, we **cannot** have a sentence without a doer.

When we are saying ケーキをたべる, what we are really saying is ∅がケーキをたべる. And the default value for ∅ is わたし: *I*.

